In [1]:
import pandas as pd
import numpy as np

In [2]:
gps = pd.read_csv('gps.csv')
car_assignments = pd.read_csv('car-assignments.csv')
cc_data = pd.read_csv('cc_data.csv', encoding = 'iso-8859-1')
loyalty_data = pd.read_csv('loyalty_data.csv', encoding = 'iso-8859-1')

In [3]:
gps

                  Timestamp  id        lat       long
0       01/06/2014 06:28:01  35  36.076225  24.874689
1       01/06/2014 06:28:01  35  36.076220  24.874596
2       01/06/2014 06:28:03  35  36.076211  24.874443
3       01/06/2014 06:28:05  35  36.076217  24.874253
4       01/06/2014 06:28:06  35  36.076214  24.874167
...                     ...  ..        ...        ...
685164  01/19/2014 20:56:43  30  36.058110  24.902130
685165  01/19/2014 20:56:47  30  36.058258  24.901774
685166  01/19/2014 20:56:48  30  36.058296  24.901711
685167  01/19/2014 20:56:49  30  36.058304  24.901620
685168  01/19/2014 20:56:55  30  36.058490  24.901095

[685169 rows x 4 columns]

In [4]:
car_assignments.head()

   LastName FirstName  CarID   CurrentEmploymentType CurrentEmploymentTitle
0   Alcazar     Lucas    1.0  Information Technology            IT Helpdesk
1     Azada      Lars    2.0             Engineering               Engineer
2     Balas     Felix    3.0             Engineering               Engineer
3  Barranco    Ingrid    4.0               Executive                SVP/CFO
4      Baza      Isak    5.0  Information Technology          IT Technician

In [5]:
cc_data.head()

       timestamp             location  price FirstName  LastName
0  1/6/2014 7:28  Brew've Been Served  11.34    Edvard      Vann
1  1/6/2014 7:34     Hallowed Grounds  52.22    Hideki  Cocinaro
2  1/6/2014 7:35  Brew've Been Served   8.33    Stenig     Fusil
3  1/6/2014 7:36     Hallowed Grounds  16.72  Birgitta    Frente
4  1/6/2014 7:37  Brew've Been Served   4.24      Sven    Flecha

In [6]:
loyalty_data.head()

  timestamp             location  price FirstName  LastName
0  1/6/2014  Brew've Been Served   4.17  Cornelia      Lais
1  1/6/2014  Brew've Been Served   9.60       Mat    Bramar
2  1/6/2014     Hallowed Grounds  16.53     Emile      Arpa
3  1/6/2014         Coffee Shack  11.51     Varro    Awelon
4  1/6/2014     Hallowed Grounds  12.93    Rachel  Pantanal

In [62]:
cc_data

            timestamp             location  price FirstName   LastName
0       1/6/2014 7:28  Brew've Been Served  11.34    Edvard       Vann
1       1/6/2014 7:34     Hallowed Grounds  52.22    Hideki   Cocinaro
2       1/6/2014 7:35  Brew've Been Served   8.33    Stenig      Fusil
3       1/6/2014 7:36     Hallowed Grounds  16.72  Birgitta     Frente
4       1/6/2014 7:37  Brew've Been Served   4.24      Sven     Flecha
...               ...                  ...    ...       ...        ...
1486  1/19/2014 20:16          Guy's Gyros  37.48     Brand  Tempestad
1487  1/19/2014 20:22      KaterinaÂ’s CafÃ©  38.90  Birgitta     Frente
1488  1/19/2014 20:25          Guy's Gyros  20.94    Loreto    Bodrogi
1489  1/19/2014 20:30          Guy's Gyros  31.94     Minke       Mies
1490  1/19/2014 20:51          Guy's Gyros  39.60     Felix    Resumir

[1491 rows x 5 columns]

In [8]:
loyalty_data

      timestamp             location   price FirstName    LastName
0      1/6/2014  Brew've Been Served    4.17  Cornelia        Lais
1      1/6/2014  Brew've Been Served    9.60       Mat      Bramar
2      1/6/2014     Hallowed Grounds   16.53     Emile        Arpa
3      1/6/2014         Coffee Shack   11.51     Varro      Awelon
4      1/6/2014     Hallowed Grounds   12.93    Rachel    Pantanal
...         ...                  ...     ...       ...         ...
1388  1/19/2014      KaterinaÂ’s CafÃ©   70.22    Edvard        Vann
1389  1/19/2014          Guy's Gyros   18.08      Isia        Vann
1390  1/19/2014      KaterinaÂ’s CafÃ©   35.01      Isia        Vann
1391  1/19/2014  Desafio Golf Course  110.02    Willem  Vasco-Pais
1392  1/19/2014          Hippokampos   63.17    Willem  Vasco-Pais

[1393 rows x 5 columns]

In [9]:
car_assignments[car_assignments.CarID.isna()]

     LastName FirstName  CarID CurrentEmploymentType CurrentEmploymentTitle
35      Hafon    Albina    NaN            Facilities           Truck Driver
36    Hawelon    Benito    NaN            Facilities           Truck Driver
37    Hawelon   Claudio    NaN            Facilities           Truck Driver
38       Mies      Henk    NaN            Facilities           Truck Driver
39     Morlun   Valeria    NaN            Facilities           Truck Driver
40     Morlun      Adan    NaN            Facilities           Truck Driver
41  Morluniau   Cecilia    NaN            Facilities           Truck Driver
42       Nant     Irene    NaN            Facilities           Truck Driver
43   Scozzese     Dylan    NaN            Facilities           Truck Driver

In [126]:
pd.set_option('display.max_rows', 10)
car_assignments

     LastName FirstName  CarID   CurrentEmploymentType CurrentEmploymentTitle
0     Alcazar     Lucas    1.0  Information Technology            IT Helpdesk
1       Azada      Lars    2.0             Engineering               Engineer
2       Balas     Felix    3.0             Engineering               Engineer
3    Barranco    Ingrid    4.0               Executive                SVP/CFO
4        Baza      Isak    5.0  Information Technology          IT Technician
..        ...       ...    ...                     ...                    ...
39     Morlun   Valeria    NaN              Facilities           Truck Driver
40     Morlun      Adan    NaN              Facilities           Truck Driver
41  Morluniau   Cecilia    NaN              Facilities           Truck Driver
42       Nant     Irene    NaN              Facilities           Truck Driver
43   Scozzese     Dylan    NaN              Facilities           Truck Driver

[44 rows x 5 columns]

In [99]:
names_dict = dict(zip(car_assignments.LastName, car_assignments.CarID))
names_dict

{'Alcazar': 1.0,
 'Azada': 2.0,
 'Balas': 3.0,
 'Barranco': 4.0,
 'Baza': 5.0,
 'Bergen': 6.0,
 'Borrasca': 7.0,
 'Calixto': 8.0,
 'Calzas': 9.0,
 'Campo-Corrente': 10.0,
 'Cazar': 11.0,
 'Cocinaro': 12.0,
 'Ferro': 13.0,
 'Dedos': 14.0,
 'Bodrogi': 15.0,
 'Vann': 34.0,
 'Flecha': 17.0,
 'Frente': 19.0,
 'Fusil': 20.0,
 'Osvaldo': 21.0,
 'Herrero': 22.0,
 'Lagos': 23.0,
 'Mies': nan,
 'Nubarron': 25.0,
 'Onda': 26.0,
 'Orilla': 28.0,
 'Ovan': 29.0,
 'Resumir': 30.0,
 'Sanjorge Jr.': 31.0,
 'Strum': 32.0,
 'Tempestad': 33.0,
 'Vasco-Pais': 35.0,
 'Hafon': nan,
 'Hawelon': nan,
 'Morlun': nan,
 'Morluniau': nan,
 'Nant': nan,
 'Scozzese': nan}

In [88]:
group = gps.groupby("id")["Timestamp", "lat", "long"].agg(lambda x: list(x))

<ipython-input-88-1dfe38bcf64f>:1: FutureWarning: Indexing with multiple keys (implicitly converted to a tuple of keys) will be deprecated, use a list instead.
  group = gps.groupby("id")["Timestamp", "lat", "long"].agg(lambda x: list(x))

In [89]:
group

,Timestamp,lat,long
id,,,
1,"[01/06/2014 07:20:01, 01/06/2014 07:20:03, 01/...","[36.066457, 36.06634441, 36.066146999999994, 3...","[24.88258237, 24.88258921, 24.88258397, 24.882..."
2,"[01/06/2014 07:30:01, 01/06/2014 07:30:01, 01/...","[36.08545957, 36.08550638, 36.08544892, 36.085...","[24.86037898, 24.860381699999998, 24.86022256,..."
3,"[01/06/2014 07:19:01, 01/06/2014 07:19:04, 01/...","[36.0866807, 36.08662352, 36.08664181, 36.0866...","[24.85762836, 24.85742898, 24.85726684, 24.857..."
4,"[01/06/2014 06:33:01, 01/06/2014 06:33:01, 01/...","[36.07820944, 36.07819206, 36.0782097, 36.0781...","[24.87214094, 24.87205572, 24.87194836, 24.871..."
5,"[01/06/2014 07:59:01, 01/06/2014 07:59:07, 01/...","[36.06730309, 36.06735541, 36.06733524, 36.067...","[24.8778979, 24.87757989, 24.87745793, 24.8774..."
...,...,...,...
101,"[01/06/2014 07:36:01, 01/06/2014 07:36:01, 01/...","[36.04802745, 36.04807266, 36.04812822, 36.048...","[24.87957667, 24.87957652, 24.87957357, 24.879..."
104,"[01/06/2014 10:32:33, 01/06/2014 10:32:33, 01/...","[36.04802836, 36.04811117, 36.04820538, 36.048...","[24.879574800000004, 24.87957595, 24.87957466,..."
105,"[01/07/2014 08:50:54, 01/07/2014 08:50:54, 01/...","[36.04802816, 36.04807319, 36.0481277, 36.0481...","[24.87956681, 24.879572, 24.87957035, 24.87957..."
106,"[01/07/2014 12:25:50, 01/07/2014 12:25:50, 01/...","[36.04802843, 36.04811248, 36.04820482, 36.048...","[24.87956736, 24.87956721, 24.87957407, 24.879..."
107,"[01/06/2014 08:46:20, 01/06/2014 08:46:20, 01/...","[36.04803001, 36.04808113, 36.048127, 36.04817...","[24.87957636, 24.87956513, 24.87956961, 24.879..."

In [118]:

from datetime import datetime
import tqdm as tqdm

In [121]:
names = car_assignments.LastName.unique()
results = []

In [122]:
for i in tqdm.tqdm(cc_data.index):
    timestamp = cc_data.iloc[i].timestamp
    date = datetime.strptime(timestamp, "%m/%d/%Y %H:%M")
    location = cc_data.iloc[i].location
    price = cc_data.iloc[i].price
    first_name = cc_data.iloc[i].FirstName
    last_name = cc_data.iloc[i].LastName

    if last_name in names and not np.isnan(names_dict[last_name]):
        row = group.iloc[int(names_dict[last_name])]

        j_min = np.inf
        t_min = np.inf

        for j in range(len(row.Timestamp)):
            d = datetime.strptime(row.Timestamp[j], "%m/%d/%Y %H:%M:%S")
            if(abs(date-d).seconds < t_min):
                j_min = j
                t_min = abs(date-d).seconds
        
        results.append((timestamp, date, location, price, first_name, last_name, row.lat[j_min], row.long[j_min]))

100%|â–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆâ–ˆ| 1491/1491 [13:30<00:00,  1.84it/s]

In [124]:
df = pd.DataFrame (results, columns=['timestamp', 'date', 'location', 'price', 'FirstName', 'LastName', 'lat', 'long'])
df.head()

,timestamp,date,location,price,FirstName,LastName,lat,long
0,1/6/2014 7:28,2014-01-06 07:28:00,Brew've Been Served,11.34,Edvard,Vann,36.048021,24.879570
1,1/6/2014 7:34,2014-01-06 07:34:00,Hallowed Grounds,52.22,Hideki,Cocinaro,36.057933,24.903888
2,1/6/2014 7:35,2014-01-06 07:35:00,Brew've Been Served,8.33,Stenig,Fusil,36.060440,24.905661
3,1/6/2014 7:36,2014-01-06 07:36:00,Hallowed Grounds,16.72,Birgitta,Frente,36.054027,24.901194
4,1/6/2014 7:37,2014-01-06 07:37:00,Brew've Been Served,4.24,Sven,Flecha,36.063674,24.885900

In [128]:
df = df.drop(columns = ["date"])

In [130]:
df['CarID'] = df.LastName.apply(lambda x: names_dict[x])

In [133]:
df = df.dropna()

In [135]:
df.to_csv('cc_data_processed.csv')

In [136]:
results = []

for i in tqdm.tqdm(loyalty_data.index):
    timestamp = loyalty_data.iloc[i].timestamp
    date = datetime.strptime(timestamp, "%m/%d/%Y %H:%M")
    location = loyalty_data.iloc[i].location
    price = loyalty_data.iloc[i].price
    first_name = loyalty_data.iloc[i].FirstName
    last_name = loyalty_data.iloc[i].LastName

    if last_name in names and not np.isnan(names_dict[last_name]):
        row = group.iloc[int(names_dict[last_name])]

        j_min = np.inf
        t_min = np.inf

        for j in range(len(row.Timestamp)):
            d = datetime.strptime(row.Timestamp[j], "%m/%d/%Y %H:%M:%S")
            if(abs(date-d).seconds < t_min):
                j_min = j
                t_min = abs(date-d).seconds
        
        results.append((timestamp, location, price, names_dict[last_name], first_name, last_name, row.lat[j_min], row.long[j_min]))

  0%|          | 0/1393 [00:00<?, ?it/s]

ValueError: time data '1/6/2014' does not match format '%m/%d/%Y %H:%M'

In [ ]:
df = pd.DataFrame (results, columns=['timestamp', 'location', 'price', 'CarID', 'FirstName', 'LastName', 'lat', 'long'])
df.head()

In [33]:
joined = joined.rename(columns={"Timestamp": "ts", "LastName": "Last", "FirstName": "First", 
                       "CurrentEmploymentType": "CETy", "CurrentEmploymentTitle": "CETi"})

joined

,ts,id,lat,long,Last,First,CarID,CETy,CETi
0,01/06/2014 06:28:01,35,36.076225,24.874689,Vasco-Pais,Willem,35.0,Executive,Environmental Safety Advisor
1,01/06/2014 06:28:01,35,36.076220,24.874596,Vasco-Pais,Willem,35.0,Executive,Environmental Safety Advisor
2,01/06/2014 06:28:03,35,36.076211,24.874443,Vasco-Pais,Willem,35.0,Executive,Environmental Safety Advisor
3,01/06/2014 06:28:05,35,36.076217,24.874253,Vasco-Pais,Willem,35.0,Executive,Environmental Safety Advisor
4,01/06/2014 06:28:06,35,36.076214,24.874167,Vasco-Pais,Willem,35.0,Executive,Environmental Safety Advisor
...,...,...,...,...,...,...,...,...,...
613072,01/19/2014 19:50:14,31,36.069647,24.895208,Sanjorge Jr.,Sten,31.0,Executive,President/CEO
613073,01/19/2014 19:50:16,31,36.069764,24.895248,Sanjorge Jr.,Sten,31.0,Executive,President/CEO
613074,01/19/2014 19:50:17,31,36.069952,24.895215,Sanjorge Jr.,Sten,31.0,Executive,President/CEO
613075,01/19/2014 19:50:21,31,36.070235,24.895215,Sanjorge Jr.,Sten,31.0,Executive,President/CEO
613076,01/19/2014 19:50:26,31,36.070632,24.895227,Sanjorge Jr.,Sten,31.0,Executive,President/CEO

In [12]:
joined.drop(columns=['id']).to_json("joined.json", indent=0)

In [38]:
car_assignments.CarID

0      1.0
1      2.0
2      3.0
3      4.0
4      5.0
5      6.0
6      7.0
7      8.0
8      9.0
9     10.0
10    11.0
11    12.0
12    13.0
13    14.0
14    15.0
15    16.0
16    17.0
17    18.0
18    19.0
19    20.0
20    21.0
21    22.0
22    23.0
23    24.0
24    25.0
25    26.0
26    27.0
27    28.0
28    29.0
29    30.0
30    31.0
31    32.0
32    33.0
33    34.0
34    35.0
35     NaN
36     NaN
37     NaN
38     NaN
39     NaN
40     NaN
41     NaN
42     NaN
43     NaN
Name: CarID, dtype: float64

In [47]:
np.sort(joined.id.unique())

array([ 1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16, 17,
       18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33, 34,
       35], dtype=int64)

In [13]:
joined.to_csv('gps-joined.csv')